<template>
  <div class="Basic-Main">
    <h2 class="tx-center">Basic Main</h2>
    <el-button class="m-l-3" @click="handleTrigger">更多</el-button>
    {{ nickname }}
    {{ size }}
    <p class="p-3 fs-md leading-loose">
      庆历四年春2，滕子京谪守巴陵郡3。越明年4，政通人和5，百废具兴6。乃重修岳阳楼7，增其旧制8，刻唐贤今人诗赋于其上9。属予作文以记之10。
      予观夫巴陵胜状11，在洞庭一湖。衔远山12，吞长江13，浩浩汤汤14，横无际涯15；朝晖夕阴，气象万千16。此则岳阳楼之大观也17，前人之述备矣18。然则北通巫峡19，南极潇湘20，迁客骚人21，多会于此22，览物之情，得无异乎23？
      若夫淫雨霏霏24，连月不开25，阴风怒号26，浊浪排空27；日星隐曜28，山岳潜形29；商旅不行30，樯倾楫摧31；薄暮冥冥32，虎啸猿啼。登斯楼也，则有去国怀乡33，忧谗畏讥34，满目萧然35，感极而悲者矣36。
      至若春和景明37，波澜不惊38，上下天光39，一碧万顷；沙鸥翔集，锦鳞游泳40；岸芷汀兰41，郁郁青青42。而或长烟一空43，皓月千里44，浮光跃金45，静影沉璧46，渔歌互答47，此乐何极48！登斯楼也，则有心旷神怡49，宠辱偕忘50，把酒临风51，其喜洋洋者矣52。
      嗟夫53！予尝求古仁人之心54，或异二者之为55。何哉？不以物喜，不以己悲56；居庙堂之高则忧其民57；处江湖之远则忧其君58。是进亦忧，退亦忧。然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎59。噫！微斯人，吾谁与归60？
      时六年九月十五日。
    </p>
    <p class="p-3 fs-md leading-loose">
      庆历四年春2，滕子京谪守巴陵郡3。越明年4，政通人和5，百废具兴6。乃重修岳阳楼7，增其旧制8，刻唐贤今人诗赋于其上9。属予作文以记之10。
      予观夫巴陵胜状11，在洞庭一湖。衔远山12，吞长江13，浩浩汤汤14，横无际涯15；朝晖夕阴，气象万千16。此则岳阳楼之大观也17，前人之述备矣18。然则北通巫峡19，南极潇湘20，迁客骚人21，多会于此22，览物之情，得无异乎23？
      若夫淫雨霏霏24，连月不开25，阴风怒号26，浊浪排空27；日星隐曜28，山岳潜形29；商旅不行30，樯倾楫摧31；薄暮冥冥32，虎啸猿啼。登斯楼也，则有去国怀乡33，忧谗畏讥34，满目萧然35，感极而悲者矣36。
      至若春和景明37，波澜不惊38，上下天光39，一碧万顷；沙鸥翔集，锦鳞游泳40；岸芷汀兰41，郁郁青青42。而或长烟一空43，皓月千里44，浮光跃金45，静影沉璧46，渔歌互答47，此乐何极48！登斯楼也，则有心旷神怡49，宠辱偕忘50，把酒临风51，其喜洋洋者矣52。
      嗟夫53！予尝求古仁人之心54，或异二者之为55。何哉？不以物喜，不以己悲56；居庙堂之高则忧其民57；处江湖之远则忧其君58。是进亦忧，退亦忧。然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎59。噫！微斯人，吾谁与归60？
      时六年九月十五日。
    </p>

    <p class="p-3 fs-md leading-loose" v-if="visible">
      庆历四年春2，滕子京谪守巴陵郡3。越明年4，政通人和5，百废具兴6。乃重修岳阳楼7，增其旧制8，刻唐贤今人诗赋于其上9。属予作文以记之10。
      予观夫巴陵胜状11，在洞庭一湖。衔远山12，吞长江13，浩浩汤汤14，横无际涯15；朝晖夕阴，气象万千16。此则岳阳楼之大观也17，前人之述备矣18。然则北通巫峡19，南极潇湘20，迁客骚人21，多会于此22，览物之情，得无异乎23？
      若夫淫雨霏霏24，连月不开25，阴风怒号26，浊浪排空27；日星隐曜28，山岳潜形29；商旅不行30，樯倾楫摧31；薄暮冥冥32，虎啸猿啼。登斯楼也，则有去国怀乡33，忧谗畏讥34，满目萧然35，感极而悲者矣36。
      至若春和景明37，波澜不惊38，上下天光39，一碧万顷；沙鸥翔集，锦鳞游泳40；岸芷汀兰41，郁郁青青42。而或长烟一空43，皓月千里44，浮光跃金45，静影沉璧46，渔歌互答47，此乐何极48！登斯楼也，则有心旷神怡49，宠辱偕忘50，把酒临风51，其喜洋洋者矣52。
      嗟夫53！予尝求古仁人之心54，或异二者之为55。何哉？不以物喜，不以己悲56；居庙堂之高则忧其民57；处江湖之远则忧其君58。是进亦忧，退亦忧。然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎59。噫！微斯人，吾谁与归60？
      时六年九月十五日。
    </p>
  </div>
</template>
<script>
import { defineComponent, ref } from "vue";
import { mapGetters, mapMutations, useStore } from "vuex";
export default defineComponent({
  name: "BasicMain",
  setup(props, { attrs, emit, slots }) {
    console.log(props, attrs, emit, slots);
  },
  computed: {
    ...mapGetters(["nickname", "size"]),
  },
  data() {
    return {
      visible: false,
    };
  },
  methods: {
    ...mapMutations(["SET_NICKNAME", "SET_SIZE"]),
    handleTrigger() {
      this.visible = !this.visible;
      this.SET_NICKNAME("ok");
      this.SET_SIZE("bigger");
    },
  },
});
</script>
<style lang="less" scoped>
.Basic-Main {
}
</style>
